---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DependentGridlineMayBeDeleted
source: html/17799f50-6032-1bd2-add8-f526a8959102.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DependentGridlineMayBeDeleted Property

Type generated gridlines will become non-associated due to changes in the type. Press delete if you wish to remove them instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId DependentGridlineMayBeDeleted { get; }
```